n = int(input("Введите число: "))
'''Ввели n - длину симметричного списка'''
i = 1
mass = []
j = int (n/2)
if (n % 2) == 0:
    '''Работаем с четной длиной списка'''
    while i<=n/2:
        """Двигаемся от начала списка до середины. добавляем в список элементы: стартуем с 1, увеличиваем на 1."""
        mass.append(i)
        i+=1
    while j>0:
        """Двигаемся от финала списка до середины, добавляем в список элементы: стартуем с n, уменьшаем на 1."""
        mass.append(j)
        j-=1
else:
    '''Работаем с нечетной длиной списка'''
    j = int (n/2)
    while i<=n/2+1:
        """Двигаемся от начала списка до середины. добавляем в список элементы: стартуем с 1, увеличиваем на 1."""
        mass.append(i)
        i+=1
    while j>0:
        """Двигаемся от финала списка до середины, добавляем в список элементы: стартуем с n, уменьшаем на 1."""
        mass.append(j)
        j-=1
print (mass)

'''Проверяем корректность получившегося списка'''
k = 0
l = len (mass)
while k <= l-1:
    '''k и l - первый и последний индексы, идут "навстречу" друг другу, пока не "встретятся"'''
    a = mass [k]
    b = mass [l-1]
    '''Присваиваем a и b элементы списка с индексами k, l-1'''
    if a == b:
        '''Если равноотстоящие от начала и конца элементы списка совпали, успех'''
        print('Ура!')
    else:
        '''Если равноотстоящие от начала и конца элементы списка не совпали, вываливаемся с сообщением'''
        print("Error!")
        break
    k+=1
    l-=1